CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_adc.h
/**
* @file cw32l052_adc.h
* @author WHXY
* @brief
* @version 0.1
* @date 2023-07-14
*
* @copyright Copyright (c) 2021
*
*/
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/

#ifndef __CW32L052_ADC_H
#define __CW32L052_ADC_H


/******************************************************************************/
/* Include files                                                              */
/******************************************************************************/
#include "cw32l052.h"
#include "base_types.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/**
 ******************************************************************************
 ** \defgroup AdcGroup AD Converter (ADC)
  **
 ******************************************************************************/

//@{

/******************************************************************************
 * Global definitions
 ******************************************************************************/
#define  ADC_INT_PRIORITY                    ((uint32_t)3)    /*ADC interrupt priority (lowest by default)  */

#define COEFF_TS                             (0.0924f)
#define ADDR_TRIM_1P5                        (0x00100A0A)
#define ADDR_TRIM_2P5                        (0x00100A0C)
#define ADDR_T0                              (0x00100A09)
/**
  * @}
  */

/** @defgroup ADC_interrupts_definition
  * @{
  */
#define ADC_IT_READY                         ((uint16_t)0x0080)
#define ADC_IT_OVW                           ((uint16_t)0x0040)
#define ADC_IT_WDTR                          ((uint16_t)0x0020)
#define ADC_IT_WDTH                          ((uint16_t)0x0010)
#define ADC_IT_WDTL                          ((uint16_t)0x0008)
#define ADC_IT_EOA                           ((uint16_t)0x0004)
#define ADC_IT_EOS                           ((uint16_t)0x0002)
#define ADC_IT_EOC                           ((uint16_t)0x0001)

#define IS_ADC_IT(IT)                        ((((IT) & (uint16_t)0xFF00) == 0x00) && ((IT) != 0x00))
#define IS_ADC_GET_IT(IT)                    (((IT) == ADC_IT_READY) || \
                                             ((IT) == ADC_IT_OVW)    || \
                                             ((IT) == ADC_IT_WDTR)   || \
                                             ((IT) == ADC_IT_WDTH)   || \
                                             ((IT) == ADC_IT_WDTL)   || \
                                             ((IT) == ADC_IT_EOA)    || \
                                             ((IT) == ADC_IT_EOS)    || \
                                             ((IT) == ADC_IT_EOC))


/** @defgroup ADC external interrupts_definition
  * @{
  */
#define ADC_TRIG_GPIOF                       ((uint32_t)0x1000000)
#define ADC_TRIG_GPIOD                       ((uint32_t)0x400000)
#define ADC_TRIG_GPIOC                       ((uint32_t)0x200000)
#define ADC_TRIG_GPIOB                       ((uint32_t)0x100000)
#define ADC_TRIG_GPIOA                       ((uint32_t)0x80000)
#define ADC_TRIG_DMA                         ((uint32_t)0x8000)
#define ADC_TRIG_I2C2                        ((uint32_t)0x4000)
#define ADC_TRIG_I2C1                        ((uint32_t)0x2000)
#define ADC_TRIG_SPI2                        ((uint32_t)0x1000)
#define ADC_TRIG_SPI1                        ((uint32_t)0x0800)
#define ADC_TRIG_UART3                       ((uint32_t)0x0400)
#define ADC_TRIG_UART2                       ((uint32_t)0x0200)
#define ADC_TRIG_UART1                       ((uint32_t)0x0100)
#define ADC_TRIG_BTIM3                       ((uint32_t)0x0080)
#define ADC_TRIG_BTIM2                       ((uint32_t)0x0040)
#define ADC_TRIG_BTIM1                       ((uint32_t)0x0020)
#define ADC_TRIG_GTIM3                       ((uint32_t)0x0008)
#define ADC_TRIG_GTIM2                       ((uint32_t)0x0004)
#define ADC_TRIG_GTIM1                       ((uint32_t)0x0002)
#define ADC_TRIG_ATIM                        ((uint32_t)0x0001)

#define IS_ADC_TRIG(TRIG)                    ((((TRIG) & (uint32_t)0x00000000) == 0x00) && ((TRIG) != 0x00))
#define IS_ADC_GET_TRIG(TRIG)                (((TRIG) == ADC_TRIG_GPIOF) || \
                                             ((TRIG) == ADC_TRIG_GPIOD)  || \
                                             ((TRIG) == ADC_TRIG_GPIOC)  || \
                                             ((TRIG) == ADC_TRIG_GPIOB)  || \
                                             ((TRIG) == ADC_TRIG_GPIOA)  || \
                                             ((TRIG) == ADC_TRIG_DMA)    || \
                                             ((TRIG) == ADC_TRIG_I2C2)   || \
                                             ((TRIG) == ADC_TRIG_I2C1)   || \
                                             ((TRIG) == ADC_TRIG_SPI2)   || \
                                             ((TRIG) == ADC_TRIG_SPI1)   || \
                                             ((TRIG) == ADC_TRIG_UART3)  || \
                                             ((TRIG) == ADC_TRIG_UART2)  || \
                                             ((TRIG) == ADC_TRIG_UART1)  || \
                                             ((TRIG) == ADC_TRIG_BTIM3)  || \
                                             ((TRIG) == ADC_TRIG_BTIM2)  || \
                                             ((TRIG) == ADC_TRIG_BTIM1)  || \
                                             ((TRIG) == ADC_TRIG_GTIM3)  || \
                                             ((TRIG) == ADC_TRIG_GTIM2)  || \
                                             ((TRIG) == ADC_TRIG_GTIM1)  || \
                                             ((TRIG) == ADC_TRIG_ATIM))


