CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_adc.h
/** @defgroup ADC_SampleTime
  * @{
  */
#define ADC_SampTime5Clk                     ((uint32_t)0x00000000)
#define ADC_SampTime6Clk                     ((uint32_t)0x00000800)
#define ADC_SampTime8Clk                     ((uint32_t)0x00001000)
#define ADC_SampTime10Clk                    ((uint32_t)0x00001800)

#define IS_ADC_SAMPLE_TIME(SAMPLE_TIME)      (((SAMPLE_TIME) == ADC_SampTime5Clk)   || \
                                             ((SAMPLE_TIME) == ADC_SampTime6Clk)    || \
                                             ((SAMPLE_TIME) == ADC_SampTime8Clk)    || \
                                             ((SAMPLE_TIME) == ADC_SampTime10Clk))



/** @defgroup ADC_TrigSel
  * @{
  */
#define ADC_TrigATimerDisable                ((uint32_t)0x00000000)
#define ADC_TrigATimerEnable                 ((uint32_t)0x00000001)

#define ADC_TrigGTimer1Disable               ((uint32_t)0x00000000)
#define ADC_TrigGTimer1Enable                ((uint32_t)0x00000002)

#define ADC_TrigGTimer2Disable               ((uint32_t)0x00000000)
#define ADC_TrigGTimer2Enable                ((uint32_t)0x00000004)

#define ADC_TrigGTimer3Disable               ((uint32_t)0x00000000)
#define ADC_TrigGTimer3Enable                ((uint32_t)0x00000008)

#define ADC_TrigBTimer1Disable               ((uint32_t)0x00000000)
#define ADC_TrigBTimer1Enable                ((uint32_t)0x00000020)

#define ADC_TrigBTimer2Disable               ((uint32_t)0x00000000)
#define ADC_TrigBTimer2Enable                ((uint32_t)0x00000040)

#define ADC_TrigBTimer3Disable               ((uint32_t)0x00000000)
#define ADC_TrigBTimer3Enable                ((uint32_t)0x00000080)

#define ADC_TrigUart1Disable                 ((uint32_t)0x00000000)
#define ADC_TrigUart1Enable                  ((uint32_t)0x00000100)

#define ADC_TrigUart2Disable                 ((uint32_t)0x00000000)
#define ADC_TrigUart2Enable                  ((uint32_t)0x00000200)

#define ADC_TrigUart3Disable                 ((uint32_t)0x00000000)
#define ADC_TrigUart3Enable                  ((uint32_t)0x00000400)

#define ADC_TrigSPI1Disable                  ((uint32_t)0x00000000)
#define ADC_TrigSPI1Enable                   ((uint32_t)0x00000800)

#define ADC_TrigSPI2Disable                  ((uint32_t)0x00000000)
#define ADC_TrigSPI2Enable                   ((uint32_t)0x00001000)

#define ADC_TrigI2C1Disable                  ((uint32_t)0x00000000)
#define ADC_TrigI2C1Enable                   ((uint32_t)0x00002000)

#define ADC_TrigI2C2Disable                  ((uint32_t)0x00000000)
#define ADC_TrigI2C2Enable                   ((uint32_t)0x00004000)

#define ADC_TrigDMADisable                   ((uint32_t)0x00000000)
#define ADC_TrigDMAEnable                    ((uint32_t)0x00008000)

#define ADC_TrigGPIOADisable                 ((uint32_t)0x00000000)
#define ADC_TrigGPIOAEnable                  ((uint32_t)0x00080000)

#define ADC_TrigGPIOBDisable                 ((uint32_t)0x00000000)
#define ADC_TrigGPIOBEnable                  ((uint32_t)0x00100000)

#define ADC_TrigGPIOCDisable                 ((uint32_t)0x00000000)
#define ADC_TrigGPIOCEnable                  ((uint32_t)0x00200000)

#define ADC_TrigGPIODDisable                 ((uint32_t)0x00000000)
#define ADC_TrigGPIODEnable                  ((uint32_t)0x00400000)

#define ADC_TrigGPIOFDisable                 ((uint32_t)0x00000000)
#define ADC_TrigGPIOFEnable                  ((uint32_t)0x01000000)

#define IS_ADC_TRIG_SEL(TRIG_SEL)            (((TRIG_SEL) == ADC_TrigATimerDisable)    || \
                                             ((TRIG_SEL) == ADC_TrigATimerEnable)      || \
                                             ((TRIG_SEL) == ADC_TrigGTimer1Disable)    || \
                                             ((TRIG_SEL) == ADC_TrigGTimer1Enable)     || \
                                             ((TRIG_SEL) == ADC_TrigGTimer2Disable)    || \
                                             ((TRIG_SEL) == ADC_TrigGTimer2Enable)     || \
                                             ((TRIG_SEL) == ADC_TrigGTimer3Disable)    || \
                                             ((TRIG_SEL) == ADC_TrigGTimer3Enable)     || \
                                             ((TRIG_SEL) == ADC_TrigBTimer1Disable)    || \
                                             ((TRIG_SEL) == ADC_TrigBTimer1Enable)     || \
                                             ((TRIG_SEL) == ADC_TrigBTimer2Disable)    || \
                                             ((TRIG_SEL) == ADC_TrigBTimer2Enable)     || \
                                             ((TRIG_SEL) == ADC_TrigBTimer3Disable)    || \
                                             ((TRIG_SEL) == ADC_TrigBTimer3Enable)     || \
                                             ((TRIG_SEL) == ADC_TrigUart1Disable)      || \
                                             ((TRIG_SEL) == ADC_TrigUart1Enable)       || \
                                             ((TRIG_SEL) == ADC_TrigUart2Disable)      || \
                                             ((TRIG_SEL) == ADC_TrigUart2Enable)       || \
                                             ((TRIG_SEL) == ADC_TrigUart3Disable)      || \
                                             ((TRIG_SEL) == ADC_TrigUart3Enable)       || \
                                             ((TRIG_SEL) == ADC_TrigSPI1Disable)       || \
                                             ((TRIG_SEL) == ADC_TrigSPI1Enable)        || \
                                             ((TRIG_SEL) == ADC_TrigSPI2Disable)       || \
                                             ((TRIG_SEL) == ADC_TrigSPI2Enable)        || \
                                             ((TRIG_SEL) == ADC_TrigI2C1Disable)       || \
                                             ((TRIG_SEL) == ADC_TrigI2C1Enable)        || \
                                             ((TRIG_SEL) == ADC_TrigI2C2Disable)       || \
                                             ((TRIG_SEL) == ADC_TrigI2C2Enable)        || \
                                             ((TRIG_SEL) == ADC_TrigDMADisable)        || \
                                             ((TRIG_SEL) == ADC_TrigDMAEnable)         || \
                                             ((TRIG_SEL) == ADC_TrigGPIOADisable)      || \
                                             ((TRIG_SEL) == ADC_TrigGPIOAEnable)       || \
                                             ((TRIG_SEL) == ADC_TrigGPIOBDisable)      || \
                                             ((TRIG_SEL) == ADC_TrigGPIOBEnable)       || \
                                             ((TRIG_SEL) == ADC_TrigGPIOCDisable)      || \
                                             ((TRIG_SEL) == ADC_TrigGPIOCEnable)       || \
                                             ((TRIG_SEL) == ADC_TrigGPIODDisable)      || \
                                             ((TRIG_SEL) == ADC_TrigGPIODEnable)       || \
                                             ((TRIG_SEL) == ADC_TrigGPIOFDisable)      || \
                                             ((TRIG_SEL) == ADC_TrigGPIOFEnable))



/** @defgroup ADC_SqrEns
  * @{
  */
#define ADC_SqrEns0                          ((uint32_t)0x00000000)
#define ADC_SqrEns01                         ((uint32_t)0x00010000)
#define ADC_SqrEns02                         ((uint32_t)0x00020000)
#define ADC_SqrEns03                         ((uint32_t)0x00030000)
#define ADC_SqrEns04                         ((uint32_t)0x00040000)
#define ADC_SqrEns05                         ((uint32_t)0x00050000)
#define ADC_SqrEns06                         ((uint32_t)0x00060000)
#define ADC_SqrEns07                         ((uint32_t)0x00070000)

#define IS_ADC_SQR_ENS(SQR_ENS)              (((SQR_ENS) == ADC_SqrEns0)   || \
                                             ((SQR_ENS) == ADC_SqrEns01)   || \
                                             ((SQR_ENS) == ADC_SqrEns02)   || \
                                             ((SQR_ENS) == ADC_SqrEns03)   || \
                                             ((SQR_ENS) == ADC_SqrEns04)   || \
                                             ((SQR_ENS) == ADC_SqrEns05)   || \
                                             ((SQR_ENS) == ADC_SqrEns06)   || \
                                             ((SQR_ENS) == ADC_SqrEns07))



/** @defgroup ADC_SqrChmux
  * @{
  * 通道0输入PA00
  * 通道1输入PA01
  * 通道2输入PA02
  * 通道3输入PA03
  * 通道4输入PA04
  * 通道5输入PA05
  * 通道6输入PA06
  * 通道7输入PA07
  * 通道8输入PC04
  * 通道9输入PC05
  * 通道10输入PB00
  * 通道11输入PB01
  * 通道12输入PB02
  * 1/3 VDDA(必须使用输入增益)
  * BGR_TS(必须使用输入增益)
  * Vref1P2(必须使用输入增益)
  */
#define ADC_SqrCh0                           ((uint32_t)0x00000000)
#define ADC_SqrCh1                           ((uint32_t)0x00000001)
#define ADC_SqrCh2                           ((uint32_t)0x00000002)
#define ADC_SqrCh3                           ((uint32_t)0x00000003)
#define ADC_SqrCh4                           ((uint32_t)0x00000004)
#define ADC_SqrCh5                           ((uint32_t)0x00000005)
#define ADC_SqrCh6                           ((uint32_t)0x00000006)
#define ADC_SqrCh7                           ((uint32_t)0x00000007)
#define ADC_SqrCh8                           ((uint32_t)0x00000008)
#define ADC_SqrCh9                           ((uint32_t)0x00000009)
#define ADC_SqrCh10                          ((uint32_t)0x0000000A)
#define ADC_SqrCh11                          ((uint32_t)0x0000000B)
#define ADC_SqrCh12                          ((uint32_t)0x0000000C)
#define ADC_SqrVddaDiV3                      ((uint32_t)0x0000000D)
#define ADC_SqrTs                            ((uint32_t)0x0000000E)
#define ADC_SqrVref1P2                       ((uint32_t)0x0000000F)

#define IS_ADC_SQR_CH(SQR_CH)                (((SQR_CH) == ADC_SqrCh0)     || \
                                             ((SQR_CH) == ADC_SqrCh1)      || \
                                             ((SQR_CH) == ADC_SqrCh2)      || \
                                             ((SQR_CH) == ADC_SqrCh3)      || \
                                             ((SQR_CH) == ADC_SqrCh4)      || \
                                             ((SQR_CH) == ADC_SqrCh5)      || \
                                             ((SQR_CH) == ADC_SqrCh6)      || \
                                             ((SQR_CH) == ADC_SqrCh7)      || \
                                             ((SQR_CH) == ADC_SqrCh8)      || \
                                             ((SQR_CH) == ADC_SqrCh9)      || \
                                             ((SQR_CH) == ADC_SqrCh10)     || \
                                             ((SQR_CH) == ADC_SqrCh11)     || \
                                             ((SQR_CH) == ADC_SqrCh12)     || \
                                             ((SQR_CH) == ADC_SqrVddaDiV3) || \
                                             ((SQR_CH) == ADC_SqrTs)       || \
                                             ((SQR_CH) == ADC_SqrVref1P2))



/** @defgroup ADC_WdtChmux
  * @{
  * 通道0输入PA00
  * 通道1输入PA01
  * 通道2输入PA02
  * 通道3输入PA03
  * 通道4输入PA04
  * 通道5输入PA05
  * 通道6输入PA06
  * 通道7输入PA07
  * 通道8输入PC04
  * 通道9输入PC05
  * 通道10输入PB00
  * 通道11输入PB01
  * 通道12输入PB02
  * 1/3 VDDA(必须使用输入增益)
  * BGR_TS(必须使用输入增益)
  * Vref1P2(必须使用输入增益)
  */
#define ADC_WdtCh0                           ((uint32_t)0x00000000)
#define ADC_WdtCh1                           ((uint32_t)0x00000100)
#define ADC_WdtCh2                           ((uint32_t)0x00000200)
#define ADC_WdtCh3                           ((uint32_t)0x00000300)
#define ADC_WdtCh4                           ((uint32_t)0x00000400)
#define ADC_WdtCh5                           ((uint32_t)0x00000500)
#define ADC_WdtCh6                           ((uint32_t)0x00000600)
#define ADC_WdtCh7                           ((uint32_t)0x00000700)
#define ADC_WdtCh8                           ((uint32_t)0x00000800)
#define ADC_WdtCh9                           ((uint32_t)0x00000900)
#define ADC_WdtCh10                          ((uint32_t)0x00000A00)
#define ADC_WdtCh11                          ((uint32_t)0x00000B00)
#define ADC_WdtCh12                          ((uint32_t)0x00000C00)
#define ADC_WdtVddaDiV3                      ((uint32_t)0x00000D00)
#define ADC_WdtTs                            ((uint32_t)0x00000E00)
#define ADC_WdtVref1P2                       ((uint32_t)0x00000F00)

