CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_adc.h
#define IS_ADC_WDT_CH(WDT_CH)                (((WDT_CH) == ADC_WdtCh0)     || \
                                             ((WDT_CH) == ADC_WdtCh1)      || \
                                             ((WDT_CH) == ADC_WdtCh2)      || \
                                             ((WDT_CH) == ADC_WdtCh3)      || \
                                             ((WDT_CH) == ADC_WdtCh4)      || \
                                             ((WDT_CH) == ADC_WdtCh5)      || \
                                             ((WDT_CH) == ADC_WdtCh6)      || \
                                             ((WDT_CH) == ADC_WdtCh7)      || \
                                             ((WDT_CH) == ADC_WdtCh8)      || \
                                             ((WDT_CH) == ADC_WdtCh9)      || \
                                             ((WDT_CH) == ADC_WdtCh10)     || \
                                             ((WDT_CH) == ADC_WdtCh11)     || \
                                             ((WDT_CH) == ADC_WdtCh12)     || \
                                             ((WDT_CH) == ADC_WdtVddaDiV3) || \
                                             ((WDT_CH) == ADC_WdtTs)       || \
                                             ((WDT_CH) == ADC_WdtVref1P2))


/** @defgroup ADC_WdtAll
  * @{
  */
#define ADC_WdtDisable                       ((uint32_t)0x00000000)
#define ADC_WdtEnable                        ((uint32_t)0x00002000)

#define IS_ADC_WDT_EN(WDT_EN)                (((WDT_EN) == ADC_WdtDisable) || \
                                             ((WDT_EN) == ADC_WdtEnable))

/** @defgroup ADC_WdtrIrq
  * @{
  */
#define ADC_WdtrDisable                      ((uint32_t)0x00000000)
#define ADC_WdtrEnable                       ((uint32_t)0x00000020)

#define IS_ADC_WDTR_EN(WDTR_EN)              (((WDTR_EN) == ADC_WdtrDisable) || \
                                             ((WDTR_EN) == ADC_WdtrEnable))

/** @defghoup ADC_WdthIrq
  * @{
  */
#define ADC_WdthDisable                      ((uint32_t)0x00000000)
#define ADC_WdthEnable                       ((uint32_t)0x00000010)

#define IS_ADC_WDTH_EN(WDTH_EN)              (((WDTH_EN) == ADC_WdthDisable) || \
                                             ((WDTH_EN) == ADC_WdthEnable))

/** @defgloup ADC_WdtlIrq
  * @{
  */
#define ADC_WdtlDisable                      ((uint32_t)0x00000000)
#define ADC_WdtlEnable                       ((uint32_t)0x00000008)

#define IS_ADC_WDTL_EN(WDTL_EN)              (((WDTL_EN) == ADC_WdtlDisable) || \
                                             ((WDTL_EN) == ADC_WdtlEnable))



/** @defgroup ADC_Align
  * @{
  */
#define ADC_AlignRight                       ((uint32_t)0x00000000)
#define ADC_AlignLeft                        ((uint32_t)0x00000040)

#define IS_ADC_DATA_ALIGN(DATA_ALIGN)        (((DATA_ALIGN) == ADC_AlignRight)   || \
                                             ((DATA_ALIGN) == ADC_AlignLeft))



/** @defgroup ADC_DataDiscard
  * @{
  */
#define ADC_DiscardNull                      ((uint32_t)0x00000000)
#define ADC_DiscardEnable                    ((uint32_t)0x00000020)

#define IS_ADC_DATA_DISCARD(DATA_DISCARD)    (((DATA_DISCARD) == ADC_DiscardNull) || \
                                             ((DATA_DISCARD) == ADC_DiscardEnable))



/** @defgroup ADC_TsEn
  * @{
  */
#define ADC_TsDisable                        ((uint32_t)0x00000000)
#define ADC_TsEnable                         ((uint32_t)0x00000020)

#define IS_ADC_TS_ENABLE(TS_ENABLE)          (((TS_ENABLE) == ADC_TsDisable) || \
                                             ((TS_ENABLE) == ADC_TsEnable))

/** @defgroup ADC_InBufEn
  * @{
  */
#define ADC_BufDisable                       ((uint32_t)0x00000000)
#define ADC_BufEnable                        ((uint32_t)0x00002000)

#define IS_ADC_BUF_ENABLE(BUF_ENABLE)        (((BUF_ENABLE) == ADC_BufDisable) || \
                                             ((BUF_ENABLE) == ADC_BufEnable))

/** @defgroup ADC_DMASOCEn
  * @{
  */
#define ADC_DMASOCDisable                    ((uint32_t)0x00000000)
#define ADC_DMASOCEnable                     ((uint32_t)0x00008000)

#define IS_ADC_DMASOC_ENABLE(DMASOC_ENABLE)  (((DMASOC_ENABLE) == ADC_DMASOCDisable) || \
                                             ((DMASOC_ENABLE) == ADC_DMASOCEnable))

/** @defgroup ADC_DMASOFEn
  * @{
  */
#define ADC_DMASOFDisable                    ((uint32_t)0x00000000)
#define ADC_DMASOFEnable                     ((uint32_t)0x00004000)

#define IS_ADC_DMASOF_ENABLE(DMASOF_ENABLE)  (((DMASOF_ENABLE) == ADC_DMASOFDisable) || \
                                             ((DMASOF_ENABLE) == ADC_DMASOFEnable))

/** @defgroup ADC_AccEn
  * @{
  */
#define ADC_AccDisable                       ((uint32_t)0x00000000)
#define ADC_AccEnable                        ((uint32_t)0x00000100)

#define IS_ADC_ACC_ENABLE(ACC_ENABLE)        (((ACC_ENABLE) == ADC_AccDisable) || \
                                             ((ACC_ENABLE) == ADC_AccEnable))

/** @defgroup ADC_AutoStop
  * @{
  */
#define ADC_AutoStopDisable                  ((uint32_t)0x00000000)
#define ADC_AutoStopEnable                   ((uint32_t)0x00000002)

#define IS_ADC_AUTO_STOP(AUTO_STOP)          (((AUTO_STOP) == ADC_AutoStopDisable) || \
                                             ((AUTO_STOP) == ADC_AutoStopEnable))

/** @defgroup ADC_AltrChmux
  * @{
  * 通道0输入PA00
  * 通道1输入PA01
  * 通道2输入PA02
  * 通道3输入PA03
  * 通道4输入PA04
  * 通道5输入PA05
  * 通道6输入PA06
  * 通道7输入PA07
  * 通道8输入PC04
  * 通道9输入PC05
  * 通道10输入PB00
  * 通道11输入PB01
  * 通道12输入PB02
  * 1/3 VDDA(必须使用输入增益)
  * BGR_TS(必须使用输入增益)
  * Vref1P2(必须使用输入增益)
  */
#define ADC_AltrCh0                           ((uint16_t)0x0001)
#define ADC_AltrCh1                           ((uint16_t)0x0002)
#define ADC_AltrCh2                           ((uint16_t)0x0004)
#define ADC_AltrCh3                           ((uint16_t)0x0008)
#define ADC_AltrCh4                           ((uint16_t)0x0010)
#define ADC_AltrCh5                           ((uint16_t)0x0020)
#define ADC_AltrCh6                           ((uint16_t)0x0040)
#define ADC_AltrCh7                           ((uint16_t)0x0080)
#define ADC_AltrCh8                           ((uint16_t)0x0100)
#define ADC_AltrCh9                           ((uint16_t)0x0200)
#define ADC_AltrCh10                          ((uint16_t)0x0400)
#define ADC_AltrCh11                          ((uint16_t)0x0800)
#define ADC_AltrCh12                          ((uint16_t)0x1000)
#define ADC_AltrVddaDiV3                      ((uint16_t)0x2000)
#define ADC_AltrTs                            ((uint16_t)0x4000)
#define ADC_AltrVref1P2                       ((uint16_t)0x8000)
#define ADC_AltrAll                           ((uint16_t)0xFFFF)
											  
#define IS_ADC_ALTR_CH(ALTR_CH)              ((ALTR_CH) <= 0x0000FFFF)

