CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_adc.h
/** @defgroup ADC_RepeatEn
  * @{
  */
#define ADC_REPEAT_Disable                    ((uint32_t)0x00000000)
#define ADC_REPEAT_Enable                     ((uint32_t)0x00010000)

#define IS_ADC_REPEAT_ENABLE(REPEAT_ENABLE)  (((REPEAT_ENABLE) == ADC_REPEAT_Disable) || \
                                             ((REPEAT_ENABLE) == ADC_REPEAT_Enable))


/******************************************************************************
 * Extern type definitions ('typedef')                                        *
 ******************************************************************************/

/**
 ******************************************************************************
 ** @brief  ADC配置
 *****************************************************************************/
typedef struct
{
    uint32_t      ADC_OpMode;      /*ADC操作模式*/

    uint32_t      ADC_ClkDiv;      /*ADC时钟选择*/

    uint32_t      ADC_SampleTime;  /*ADC采样时间*/

    uint32_t      ADC_VrefSel;     /*ADC参考电压*/

    uint32_t      ADC_InBufEn;     /*ADC输入增益使能*/

    uint32_t      ADC_TsEn;        /*内置温度传感器使能*/

    uint32_t      ADC_DMASOCEn;    /*ADC转换完成触发DMA使能*/

    uint32_t      ADC_Align;       /*ADC转换结果对齐方式*/

    uint32_t      ADC_AccEn;       /*转换结果累加使能*/
} ADC_InitTypeDef;

/**
 ******************************************************************************
 ** @brief  ADC模拟看门狗配置
 *****************************************************************************/
typedef struct
{
    uint32_t    ADC_WdtCh;       /*ADC模拟看门狗通道*/

    uint32_t    ADC_WdtAll;      /*ADC模拟看门狗使能*/

    uint32_t    ADC_WdtrIrq;     /*ADC区间模拟看门狗使能*/

    uint32_t    ADC_WdthIrq;     /*ADC上超出模拟看门狗使能*/

    uint32_t    ADC_WdtlIrq;     /*ADC下超出模拟看门狗使能*/

    uint32_t    ADC_Vth;         /*ADC模拟看门狗上阈值*/

    uint32_t    ADC_Vtl;         /*ADC模拟看门狗下阈值*/
} ADC_WdtTypeDef;

/**
 ******************************************************************************
 ** @brief  ADC单通道配置
 *****************************************************************************/
typedef struct
{
    uint32_t          ADC_Chmux;      /*ADC单通道转换模式待转换通道*/

    uint32_t          ADC_DiscardEn;  /*单通道ADC转换结果保存策略配置*/

    ADC_InitTypeDef   ADC_InitStruct; /*ADC初始化*/

    ADC_WdtTypeDef    ADC_WdtStruct;  /*ADC模拟看门狗配置*/
} ADC_SingleChTypeDef;

/**
 ******************************************************************************
 ** @brief  ADC序列配置
 *****************************************************************************/
typedef struct
{
    uint32_t         ADC_SqrEns;      /*ADC序列转换的序列配置*/
  
    uint32_t         ADC_Sqr7Chmux;   /*ADC序列7待转换通道*/
  
    uint32_t         ADC_Sqr6Chmux;   /*ADC序列6待转换通道*/
  
    uint32_t         ADC_Sqr5Chmux;   /*ADC序列5待转换通道*/
  
    uint32_t         ADC_Sqr4Chmux;   /*ADC序列4待转换通道*/
  
    uint32_t         ADC_Sqr3Chmux;   /*ADC序列3待转换通道*/
  
    uint32_t         ADC_Sqr2Chmux;   /*ADC序列2待转换通道*/
  
    uint32_t         ADC_Sqr1Chmux;   /*ADC序列1待转换通道*/
  
    uint32_t         ADC_Sqr0Chmux;   /*ADC序列0待转换通道*/
  
    uint32_t         ADC_DMASOFEn;    /*ADC序列转换完成触发DMA使能*/

    ADC_InitTypeDef  ADC_InitStruct;  /*ADC初始化*/
} ADC_SerialChTypeDef;

/**
 ******************************************************************************
 ** @brief  ADC逐通道依次转换模式配置
 *****************************************************************************/
typedef struct
{
    uint32_t         ADC_RepeatEn;   /*ADC逐通道依次转换模式单次/持续转换配置*/
  
    uint32_t         ADC_AltrChmux;   /*ADC逐通道依次待转换通道*/
  
    uint32_t         ADC_DMASOFEn;    /*ADC逐通道依次转换完成触发DMA使能*/

    ADC_InitTypeDef  ADC_InitStruct;  /*ADC初始化*/
} ADC_AltrTypeDef;

/**
 ******************************************************************************
 ** @brief  ADC中断配置
 *****************************************************************************/
typedef struct
{
    boolean_t  ADC_ReadyFlag; /*ADC初始化完成标志*/

    boolean_t  ADC_OvwIrq;    /*ADC转换结果溢出中断*/

    boolean_t  ADC_WdtrIrq;   /*ADC模拟看门狗区间中断*/

    boolean_t  ADC_WdthIrq;   /*ADC模拟看门狗上阈值中断*/

    boolean_t  ADC_WdtlIrq;   /*ADC模拟看门狗下阈值中断*/

    boolean_t  ADC_EoaIrq;    /*ADC多次转换完成中断*/

    boolean_t  ADC_EosIrq;    /*ADC序列转换完成中断*/

    boolean_t  ADC_EocIrq;    /*ADC单次转换完成中断*/
} ADC_IrqTypeDef;

/******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/******************************************************************************
 * Global function prototypes (definition in C source)
 ******************************************************************************/
//ADC去初始化
void ADC_DeInit(void);
//ADC初始化
void ADC_Init(ADC_InitTypeDef* ADC_InitStruct);
//ADC默认值初始化
void ADC_StructInit(ADC_InitTypeDef* ADC_InitStruct);
//ADC模拟看门狗默认值初始化
void ADC_WdtInit(ADC_WdtTypeDef* ADC_WdtStruct);
//ADC使能
int ADC_Enable(void);
//ADC禁用
void ADC_Disable(void);

//触发DMASOC读取命令
void ADC_DmaSocCmd(FunctionalState NewState);
//触发DMASOC读取使能
void ADC_DmaSocEnable(void);
//触发DMASOC读取禁止
void ADC_DmaSocDisable(void);

//触发DMASOF读取命令
void ADC_DmaSofCmd(FunctionalState NewState);
//触发DMASOF读取使能
void ADC_DmaSofEnable(void);
//触发DMASOF读取禁止
void ADC_DmaSofDisable(void);

//ADC转换软件启动命令
void ADC_SoftwareStartConvCmd(FunctionalState NewState);
//ADC外部中断触发源配置
void ADC_ExtTrigCfg(uint16_t ADC_TRIG, FunctionalState NewState);

//单通道转换模式公共配置
void ADC_SingleChCommon(ADC_SingleChTypeDef* ADC_SingleChStruct);
//ADC单通道单次转换模式配置
void ADC_SingleChOneModeCfg(ADC_SingleChTypeDef* ADC_SingleChStruct);
//ADC单通道多次转换模式配置
void ADC_SingleChMoreModeCfg(ADC_SingleChTypeDef* ADC_SingleChStruct, uint8_t cntAdcSample);
//ADC单通道连续转换模式配置
void ADC_SingleChContinuousModeCfg(ADC_SingleChTypeDef* ADC_SingleChStruct);
//ADC序列转换模式公共配置
void ADC_SerialChCommon(ADC_SerialChTypeDef* ADC_SerialChStruct);
//ADC序列连续转换模式配置
void ADC_SerialChContinuousModeCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//ADC序列扫描转换模式配置
void ADC_SerialChScanModeCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//ADC序列多次转换模式配置
void ADC_SerialChMoreModeCfg(ADC_SerialChTypeDef* ADC_SerialChStruct, uint8_t cntAdcSample);
//ADC序列断续转换模式配置
void ADC_SerialChBreakModeCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);

