CopyPasteMaster-CG/cw32l010/mcu_lib/inc/cw32l052_adc.h
//序列SQR0转换通道配置
void ADC_Sqr0ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0/SQR1转换通道配置
void ADC_Sqr01ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR2转换通道配置
void ADC_Sqr02ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR3转换通道配置
void ADC_Sqr03ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR4转换通道配置
void ADC_Sqr04ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR5转换通道配置
void ADC_Sqr05ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR6转换通道配置
void ADC_Sqr06ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR7转换通道配置
void ADC_Sqr07ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);

//ADC逐通道依次转换模式配置
void ADC_AltrModeCfg(ADC_AltrTypeDef* ADC_AltrStruct);

//设置单通道模式
void ADC_SetSingleCh( uint32_t enAdcSampCh);
//设置序列模式
void ADC_SetSerialCh( uint32_t enAdcSampCh);

//ADC模拟看门狗配置
void ADC_WdtConfig(ADC_WdtTypeDef* ADC_WdtStruct);

//ADC中断配置
void ADC_ITConfig(uint16_t ADC_IT, FunctionalState NewState);
//ADC中断使能
void ADC_EnableIrq(uint8_t intPriority);
//ADC中断禁止
void ADC_DisableIrq(void);
//使能NVIC中ADC中断
void ADC_EnableNvic(uint8_t intPriority);
//禁用NVIC中ADC中断
void ADC_DisableNvic(void);
//获取ADC所有中断状态
void ADC_GetITStatusAll(volatile uint8_t* pFlagAdcIrq);
//获取ADC指定的中断状态
ITStatus ADC_GetITStatus(uint16_t ADC_IT);
//清除ADC所有中断状态
void ADC_ClearITPendingAll(void);
//清除ADC指定的中断状态
void ADC_ClearITPendingBit(uint16_t ADC_IT);

//获取单次转换采样值
uint16_t ADC_GetConversionValue(void);
//获取SQR0通道采样值
void ADC_GetSqr0Result(uint16_t* pAdcResult);
//获取SQR1通道采样值
void ADC_GetSqr1Result(uint16_t* pAdcResult);
//获取SQR2通道采样值
void ADC_GetSqr2Result(uint16_t* pAdcResult);
//获取SQR3通道采样值
void ADC_GetSqr3Result(uint16_t* pAdcResult);
//获取SQR4通道采样值
void ADC_GetSqr4Result(uint16_t* pAdcResult);
//获取SQR5通道采样值
void ADC_GetSqr5Result(uint16_t* pAdcResult);
//获取SQR6通道采样值
void ADC_GetSqr6Result(uint16_t* pAdcResult);
//获取SQR7通道采样值
void ADC_GetSqr7Result(uint16_t* pAdcResult);
//获取累加采样值
void ADC_GetAccResult(uint32_t* pAdcAccResult);
//清零累加采样值
void ADC_ClrAccResult(void);

//设置参考电压
void ADC_SetVref(uint32_t ADC_VrefSel);
//设置结果对齐方式
void ADC_SetAlign(uint32_t enAlign);
//设置单通道ADC转换结果溢出保存策略
void ADC_SetDiscard(uint32_t enDiscard);
//设置内置温度传感器使能控制
void ADC_SetTs(uint32_t enTs);
//读取ADC参考电压1.5V时的温度传感器的测量温度
void ADC_GetTsVref1V5(float* fAdcTsDegree);
//读取ADC参考电压2.5V时的温度传感器的测量温度
void ADC_GetTsVref2V5(float* fAdcTsDegree);
//设置ADC转换结束自动停止
void ADC_AutoStop(uint32_t enAutoStop);
//@}
#ifdef __cplusplus
}
#endif

#endif /* __CW32L052_ADC_H */
/******************************************************************************/
/* EOF (not truncated)                                                        */
/******************************************************************************/
